
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>Information Technology</title>
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Kanit:wght@300;400&display=swap" rel="stylesheet">

    <style>
        :root {
            --primary-color: #aa1818;
            --secondary-color: #FFFFFF;
        }

        .card-text {
            color: var(--secondary-color);
            font-family: 'Kanit', sans-serif;
            background-color: var(--primary-color);
            padding: 10px;
            font-size: 14px;
            width: 810px;
            box-shadow: 0 2px 5px rgba(0, 0, 0, 0.1);
        }

        .m2 {
            color: #000000;
            font-family: 'Kanit', sans-serif;
            font-size: 12px;
            background-color: #D9D9D9;
            height: 300px;
        }
    </style>
</head>
<body>
<div class="container">
    <jsp:include page="/WEB-INF/layouts/nav.jsp"/>
</div>
<br>
<br>
<div class="alum_img" align="center">
    <img style="width: 90%;" src="${pageContext.request.contextPath}/assets/image/1.png">
</div>
<br><br>
<div class="im" style="float: left; margin-left: 30px" >
    <img style="width:300px;margin-top: 35px;" src="${pageContext.request.contextPath}/assets/image/p.png">
</div>
<div class="con" style="float: left; margin-left: 20px; margin-top: 10px" align="center">
    <p class="card-text">
        หลักสูตรพัฒนาเพื่อตอบสนองความต้องการของประเทศทางด้านการพัฒนาอุตสาหกรรมซอฟต์แวร์ ในยุคประเทศไทย 4.0<br>
        ตอบสนองต่อการเปลี่ยนแปลงของสังคมโลก เป็นที่ยอมรับระดับสากลเน้นการใช้เทคโนโลยีขั้นสูงในการสร้างองค์ความรู้<br>
        ซึ่งต้องใช้บุคลากรทางเทคโนโลยีสารสนเทศที่มีคุณภาพเป็นจำนวนมาก จากนโยบายและแผนระดับชาติว่าด้วยการพัฒนาดิจิทัล<br>
        เพื่อเศรษฐกิจและสังคม จะเป็นแผนแม่บทหลักในการพัฒนาเศรษฐกิจและสังคมดิจิทัลของประเทศ ระยะ 20 ปี<br>
        (พ.ศ. 2561 – 2580) ที่กำหนดทิศทาง การขับเคลื่อนการพัฒนาประเทศที่ยั่งยืนโดยใช้เทคโนโลยีดิจิทัล<br>

        สาขาวิชาฯ เริ่มเปิดดำเนินการมาตั้งแต่ปี 2545 โดยระบบการเรียนการสอนของสาขาวิชาฯ เน้นด้านการพัฒนาโปรแกรม<br>
        เป็นหลักดังนั้นจึงจำเป็นต้องใช้ทักษะทางด้านคณิตศาสตร์และแนวคิดในการวางแผนอย่างเป็นระบบ นอกจากนั้นสาขาวิชาฯ<br>
        ยังให้ความสำคัญกับเทคโนโลยีใหม่ๆที่ใช้ในกระบวนการพัฒนาระบบอาทิ การโปรแกรมเชิงวัตถุ<br>
        การพัฒนาโปรแกรมบนอุปกรณ์เคลื่อนที่ การวิเคราะห์และการออกแบระบบเชิงวัตถ ตลอดจนการทดสอบระบบ<br>
        ด้วยเครื่องมืออันที่ทันสมัยโดยมีเป้าหมายในการผลิตบัณฑิต เพื่อตอบสนองต่อความต้องการของตลาดเป็นอันดับแรก<br>
        ดังนั้นบัณฑิตของสาขาวิชาฯต้องมีทักษะด้านปฏิบัติเป็นสำคัญส่งผลให้สาขาวิชาฯ เป็นหนึ่งในจำนวนสาขาที่ประสบความสำเร็จสูงสุด<br>
        ในแง่การผลิตบัณฑิตที่มีจำนวนผู้ได้งานและรายได้ต่อหัวสูงสุดของมหาวิทยาลัยแม่โจ้ นับตั้งแต่รุ่นแรกจนถึงปัจจุบัน<br>
        *การเรียนการสอนของสาขาวิชาเทคโนโลยีสารสนเทศ ไม่เน้นที่การออกแบบ Graphic<br>
        การสร้างภาพเคลื่อนไหวและมัลติมีเดียเช่นเดียวกับสาขาเทคโนโลยีสารสนเทศของสถาบันอื่นๆ *
</div>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<div class="m2">
    <div style="float: left; margin-left: 40px">

           <h4>ปรัชญาการศึกษาของหลักสูตร</h4>
        <p>
            “ผลิตบัณฑิตที่มีความรู้ ความสามารถ และทักษะการเรียนรู้ตลอดชีวิตในการปฏิบัติงานทางด้านเทคโนโลยี<br>
            ให้สามารถออกแบบ พัฒนา และ ทดสอบซอฟต์แวร์ ที่สนับสนุนการใช้งานในองค์กรและสามารถนำความรู้<br>
            ไปประยุกต์ใช้ได้อย่างเหมาะสมอีกทั้งยังมีความสามารถในการสื่อสารและทำงานเป็นทีมโดยมีจรรยาบรรณ<br>
            ในวิชาชีพด้านเทคโนโลยีสารสนเทศ”
        </p>
            <h4>วัตถุประสงค์ของหลักสูตร</h4>
        <p>
            1. เพื่อผลิตบัณฑิตให้มีความรู้ความสามารถในการปฏิบัติงานทางด้านเทคโนโลยี ให้สามารถออกแบบพัฒนา<br>
            และทดสอบซอฟต์แวร์ ที่สนับสนุนการใช้งานในองค์กร และสามารถนำความรู้ไปประยุกต์ใช้ได้อย่างเหมาะสม<br>
            2. เพื่อผลิตบัณฑิตให้มีความเข้าใจและประยุกต์ใช้ในกระบวนการพัฒนาระบบสารสนเทศและมีความสามารถในการสื่อสาร<br>
            ทำงานเป็นทีมได้ เป็นผู้ที่มีความเข้าใจด้านสังคม องค์กรและคุณธรรมจริยธรรมในวิชาชีพด้านเทคโนโลยีสารสนเทศ<br>
            3. เพื่อผลิตบัณฑิตให้มีความสามารถในการจัดการปัญหาและการเรียนรู้ศาสตร์ใหม่ได้ด้วยตนเองโดยใช้เทคโนโลยี<br>
            สารสนเทศสำหรับการเรียนรู้
        </p>
    </div>
    <div class="im2"  >
        <img style="width:600px;margin-left: 10px; margin-top: 8px" src="${pageContext.request.contextPath}/assets/image/nn.jpg">
    </div>
</div>
</body>
</html>
